#+title: Heat Flow Analysis

* Usage
#+BEGIN_SRC elisp
(pyvenv-activate "./../../.venv")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh
echo $VIRTUAL_ENV
which python
#+END_SRC

#+RESULTS:
| /home/dany/Personal/hackathon-techxplosion/backend/.venv            |
| /home/dany/Personal/hackathon-techxplosion/backend/.venv/bin/python |

#+begin_src python :results output
import sys
print(sys.executable)
from heat_flow_analysis import (
    estimate_thermal_properties,
    build_graph_from_adjacency,
    history_from_room_history,
    EstimationConfig,
)

# Build thermal graph from room adjacency
graph = build_graph_from_adjacency(
    room_ids=["room_a", "room_b", "room_c"],
    adjacency={"room_a": ["room_b"], "room_b": ["room_a", "room_c"], "room_c": ["room_b"]},
    exterior_rooms={"room_a", "room_c"},
)

# Convert historical data
histories = history_from_room_history(room_histories)

# Run estimation
config = EstimationConfig(dt_seconds=180.0)
result = estimate_thermal_properties(
    histories=histories,
    graph=graph,
    external_temp=10.0,
    config=config,
)

print(f"R-squared: {result.r_squared:.3f}")
print(f"RMSE: {result.rmse:.4f} K")
for room_id, C in result.thermal_mass.items():
    print(f"{room_id}: C = {C/1000:.1f} kJ/K")
for (a, b), G in result.conductance.items():
    print(f"{a} <-> {b}: G = {G:.2f} W/K")
#+end_src

#+RESULTS:
: /home/dany/Personal/hackathon-techxplosion/.venv/bin/python




